ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_sm3_regs.xml
<module id="HSM_SM3" HW_revision="" description="HSM SM3 Registers">
	<register id="SM3_DATA_IN_0" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_1" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_2" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_3" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_4" width="32" page="0" offset="16" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_5" width="32" page="0" offset="20" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_6" width="32" page="0" offset="24" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_7" width="32" page="0" offset="28" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_8" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_9" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_10" width="32" page="0" offset="40" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_11" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_12" width="32" page="0" offset="48" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_13" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_14" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DATA_IN_15" width="32" page="0" offset="60" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_IO_BUF_CTRL_STAT" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="OUTBUF_FULL" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="IN_AV" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DATA_IN_AV" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PAD_MESSAGE" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GET_DIGEST" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LENGHT_IN_AV" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="WB_RFD_IN" description="" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="DIGEST_IN_AV" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MODE_IN_AV" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_0" description="" begin="31" end="9" width="23" rwaccess="R"/>
	</register>
	<register id="SM3_MODE_IN" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="NEW_HASH" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_0" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="SM3_LENGTH_IN_0" width="32" page="0" offset="72" internal="0" description="">
		<bitfield id="LENTH_IN_0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_LENGTH_IN_1" width="32" page="0" offset="76" internal="0" description="">
		<bitfield id="LENTH_IN_1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DIGEST_IN_0" width="32" page="0" offset="80" internal="0" description="">
		<bitfield id="DIGEST_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DIGEST_IN_1" width="32" page="0" offset="84" internal="0" description="">
		<bitfield id="DIGEST_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DIGEST_IN_2" width="32" page="0" offset="88" internal="0" description="">
		<bitfield id="DIGEST_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DIGEST_IN_3" width="32" page="0" offset="92" internal="0" description="">
		<bitfield id="DIGEST_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DIGEST_IN_4" width="32" page="0" offset="96" internal="0" description="">
		<bitfield id="DIGEST_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DIGEST_IN_5" width="32" page="0" offset="100" internal="0" description="">
		<bitfield id="DIGEST_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DIGEST_IN_6" width="32" page="0" offset="104" internal="0" description="">
		<bitfield id="DIGEST_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DIGEST_IN_7" width="32" page="0" offset="108" internal="0" description="">
		<bitfield id="DIGEST_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM3_DIGEST_OUT_0" width="32" page="0" offset="112" internal="0" description="">
		<bitfield id="DIGEST_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM3_DIGEST_OUT_1" width="32" page="0" offset="116" internal="0" description="">
		<bitfield id="DIGEST_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM3_DIGEST_OUT_2" width="32" page="0" offset="120" internal="0" description="">
		<bitfield id="DIGEST_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM3_DIGEST_OUT_3" width="32" page="0" offset="124" internal="0" description="">
		<bitfield id="DIGEST_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM3_DIGEST_OUT_4" width="32" page="0" offset="128" internal="0" description="">
		<bitfield id="DIGEST_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM3_DIGEST_OUT_5" width="32" page="0" offset="132" internal="0" description="">
		<bitfield id="DIGEST_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM3_DIGEST_OUT_6" width="32" page="0" offset="136" internal="0" description="">
		<bitfield id="DIGEST_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM3_DIGEST_OUT_7" width="32" page="0" offset="140" internal="0" description="">
		<bitfield id="DIGEST_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM3_CONFIG" width="32" page="0" offset="248" internal="0" description="">
		<bitfield id="CALC_MODULE" description="" begin="2" end="0" width="3" rwaccess="R"/>
		<bitfield id="IN_DATA_BUF" description="" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="OUT_DIG_BUF" description="" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="RESERVED_0" description="" begin="31" end="5" width="27" rwaccess="R"/>
	</register>
	<register id="SM3_VERSION" width="32" page="0" offset="252" internal="0" description="">
		<bitfield id="EIP_NUM" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="COMPLEMENT_IP_NUMBER" description="" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="PATCH_LEVEL" description="" begin="19" end="16" width="4" rwaccess="R"/>
		<bitfield id="REVISION_MINOR" description="" begin="23" end="20" width="4" rwaccess="R"/>
		<bitfield id="REVISION_MAJOR" description="" begin="27" end="24" width="4" rwaccess="R"/>
		<bitfield id="RESERVED_0" description="" begin="31" end="28" width="4" rwaccess="R"/>
	</register>
	<register id="SM3_SYSCONFIG" width="32" page="0" offset="256" internal="0" description="SM3 sysconfig registers">
		<bitfield id="AUTO_CTRL" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_DATA_IN_EN" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_DIGEST_OUT_EN" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_CONTEXT_IN_EN" description="" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SM3_IRQSTATUS" width="32" page="0" offset="260" internal="0" description="SM3 irqstatus registers">
		<bitfield id="CONTEXT_IN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DATA_IN" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DIGEST_OUT" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SM3_IRQENABLE" width="32" page="0" offset="264" internal="0" description="SM3 irqenable registers">
		<bitfield id="CONTEXT_IN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DATA_IN" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DIGEST_OUT" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
</module>
